/*
Задание: Дан массив с числами. Проверьте, есть ли в нем два одинаковых числа подряд. Если есть - выведите 'да', а если нет - выведите 'нет'.
*/

public class Main {
    public static void main(String[] args) {
        int[] a1 = {1, 2, 2, 3, 4, 5, 6, 7, 8};
        for (int i = 0; i < 1; i++) {
            for (int j = 1; j < 2; j++) {
                if (a1[i] == a1[j]) {
                    System.out.println("Да");
                } else {
                    System.out.println("Нет");
                }
//
                //напишите тут ваш код
            }


        }
    }
}
//прошу прощения, не могу понять что именно пропустил...
